# DefinitionGroups Properties

---
The DefinitionGroups type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Identifies if the definition groups collection is empty.
| Item| Retrieve a definition group by name.
| Size| The number of definition groups in the collection.
Top
#### Reference
DefinitionGroups Class
Autodesk.Revit.DB Namespace